Repository: python/pootle-python-org-backup
Catalog: tmxes/fr/faq.tmx
Source language: en
Languages: fr

source: :meth:`~str.join` is a string method because in using it you are telling the separator string to iterate over a sequence of strings and insert itself between adjacent elements. This method can be used with any argument which obeys the rules for sequence objects, including any new classes you might define yourself. Similar methods exist for bytes and bytearray objects.
fr: :meth:`~str.join` est une méthode de chaîne parce qu'en l'utilisant vous dites au séparateur de chaîne d'itérer autour d'une séquence de chaînes et de s'insérer entre les éléments adjacents. Cette méthode peut être utilisée avec n'importe quel argument qui obéit aux règles d'objets séquence, incluant n'importe quelles nouvelles classes que vous pourriez définir vous-même. Des méthodes similaires existent pour des objets bytes et bytearray.

source: By using global variables. This isn't thread-safe, and is not recommended.
fr: En utilisant des variables globales. Ce qui n'est pas thread-safe, et n'est donc pas recommandé.

source: By passing a mutable (changeable in-place) object::
fr: En passant un objet mutable (modifiable par remplacement)::

source: By passing in a dictionary that gets mutated::
fr: En utilisant un dictionnaire, qui est modifié (en place).

source: There's almost never a good reason to get this complicated.
fr: Il n'y a pratiquement jamais de bonne raison de faire quelque chose d'aussi compliqué.

source: Your best choice is to return a tuple containing the multiple results.
fr: Votre meilleure option est de renvoyer un tuple contenant les résultats multiples.

source: How do you make a higher order function in Python?
fr: Comment construire une fonction de grand ordre en Python?

source: You have two choices: you can use nested scopes or you can use callable objects. For example, suppose you wanted to define ``linear(a,b)`` which returns a function ``f(x)`` that computes the value ``a*x+b``. Using nested scopes::
fr: Vous avez deux choix: vous pouvez utiliser les portées imbriquées ou vous pouvez utiliser des objets appelable. Par exemple, supposons que vous vouliez définir ``lineare (a, b)`` qui retourne une fonction ``f (x)`` qui calcule la valeur ``a * x + b``. En utilisant les portées imbriquées::

source: Or using a callable object::
fr: Ou en utilisant un objet appelable.

source: In both cases, ::
fr: dans les deux cas, ::

source: gives a callable object where ``taxes(10e6) == 0.3 * 10e6 + 2``.
fr: retourne un objet appelable tel que ``taxes(10e6) == 0.3 * 10e6 + 2``.

source: The callable object approach has the disadvantage that it is a bit slower and results in slightly longer code. However, note that a collection of callables can share their signature via inheritance::
fr: L'approche par objet appelables a le désavantage d'être légèrement plus lente et de produire un code légèrement plus long. Cependant, il faut noter qu'une collection d'objet appelables peuvent partager leur signatures par héritage::

source: Here ``inc()``, ``dec()`` and ``reset()`` act like functions which share the same counting variable.
fr: Ici ``inc()``, ``dec()`` et ``reset`` agissent comme des fonctions partageant une même variable compteur.

source: How do I copy an object in Python?
fr: Comment copier un objet en Python?

source: In general, try :func:`copy.copy` or :func:`copy.deepcopy` for the general case. Not all objects can be copied, but most can.
fr: En général, essayez :funct:`copy.copy` ou :func:`copy.deepcopy` pour le cas général. Tout les objets ne peuvent pas être copiés, mais la plupart peuvent.

source: Some objects can be copied more easily. Dictionaries have a :meth:`~dict.copy` method::
fr: Certains objects peuvent être copiés plus facilement. Les Dictionnaires ont une méthode :meth:`~dict.copy` ::

source: Sequences can be copied by slicing::
fr: Les séquences peuvent être copiées par tranches::

source: How can I find the methods or attributes of an object?
fr: Comment puis-je trouver les méthodes ou les attribues d'un objet?

source: For an instance x of a user-defined class, ``dir(x)`` returns an alphabetized list of the names containing the instance attributes and methods and attributes defined by its class.
fr: Pour une instance x d'une classe définie par un utilisateur, ``dir(x)`` renvoie une liste alphabétique des noms contenants les attributs de l'instance, et les attributs et méthodes définies par sa classe.

source: How can my code discover the name of an object?
fr: Comment mon code peut il découvrir le nom d'un objet?

source: Generally speaking, it can't, because objects don't really have names. Essentially, assignment always binds a name to a value; The same is true of ``def`` and ``class`` statements, but in that case the value is a callable. Consider the following code::
fr: De façon générale, il ne peut pas, par ce que les objets n'ont pas réellement de noms. Essentiellement, l'assignation attache un nom à une valeur; C'est vrai aussi pour les mots clés ``def`` et ``class``, à la différence que la valeur est un objet appelable.

source: Arguably the class has a name: even though it is bound to two names and invoked through the name B the created instance is still reported as an instance of class A. However, it is impossible to say whether the instance's name is a or b, since both names are bound to the same value.
fr: Le fait que la classe ait un nom est discutable, même si elle a deux noms et qu'elle est appelé via le nom B, l'instance crée déclare tout de même être une instance de la classe A. De même Il est impossible de dire si le nom de l'instance est a ou b, les deux noms sont attachés à la même valeur.

source: Generally speaking it should not be necessary for your code to "know the names" of particular values. Unless you are deliberately writing introspective programs, this is usually an indication that a change of approach might be beneficial.
fr: De façon général, il ne devrait pas être nécessaire pour votre application de "connaitre le nom" d'une valeur particulière. À moins que vous soyez délibérément en train d'écrire un programme introspectif, c'est souvent une indication qu'un changement d'approche pourrait être bénéfique.

source: In comp.lang.python, Fredrik Lundh once gave an excellent analogy in answer to this question:
fr: Sur comp.lang.python, Fredrik Lundh a donné un jour une excellente analogie pour répondre à cette question:

source: The same way as you get the name of that cat you found on your porch: the cat (object) itself cannot tell you its name, and it doesn't really care -- so the only way to find out what it's called is to ask all your neighbours (namespaces) if it's their cat (object)...
fr: De la même manière que vous trouvez le nom du chat que vous avez trouvé dans votre coure: le chat ne peux pas vous dire lui même son nom, et il s'en moque un peu -- alors le meilleur moyen de savoir comment il est appelé est de demander à tous vos voisins (namespaces) si c'est leur chat (object)…

source: ....and don't be surprised if you'll find that it's known by many names, or no name at all!
fr: …et ne soyez pas surpris si vous découvrez qu'il est connus sous plusieurs noms différents, ou pas de nom du tout!

source: What's up with the comma operator's precedence?
fr: Quel est le souci avec la précédente de l'opérateur virgule?

source: Comma is not an operator in Python. Consider this session::
fr: Virgule n'est pas un opérateur en Python. Observez la session suivante::

source: Since the comma is not an operator, but a separator between expressions the above is evaluated as if you had entered::
fr: Comme la virgule n'est pas un opérateur, mais un séparateur entre deux expression, l'expression ci dessus, est évaluée de la même façon que si vous aviez écrit::

source: not::
fr: et non::

source: The same is true of the various assignment operators (``=``, ``+=`` etc). They are not truly operators but syntactic delimiters in assignment statements.
fr: Ceci est vrai de tous les opérateurs d'assignations (``=``, ``+=`` etc). Ce ne sont pas vraiment des opérateurs mais des délimiteurs syntaxiques dans les instructions d'assignation.

source: Is there an equivalent of C's "?:" ternary operator?
fr: Existe-t'il un équivalent à l'opérateur "?:" ternaire du C?

source: Yes, this feature was added in Python 2.5. The syntax would be as follows::
fr: Oui, cette fonctionnalité à été ajouté à partir de Python 2.5. La syntaxe est la suivante::

source: For versions previous to 2.5 the answer would be 'No'.
fr: Pour les versions précédentes de python la réponse serait "Non".

source: In many cases you can mimic ``a ? b : c`` with ``a and b or c``, but there's a flaw: if *b* is zero (or empty, or ``None`` -- anything that tests false) then *c* will be selected instead. In many cases you can prove by looking at the code that this can't happen (e.g. because *b* is a constant or has a type that can never be false), but in general this can be a problem.
fr: Dans de nombreux cas vous pouvez imiter ``a ? b : c`` par ``a and b or c``, mais il y a une faille: si *b* est zéro (ou vide ou None -- n'importe quoi qui soit assimilé à False) alors *c* sera choisit à la place. Dans de nombreux cas vous pouvez montrer que ça ne peux pas arriver par observation du code (par exemple si *b* est une constante ou est d'un type ne pouvant être assimilé à False), mais dans le cas général cela peut être un problème.

source: Tim Peters (who wishes it was Steve Majewski) suggested the following solution: ``(a and [b] or [c])[0]``. Because ``[b]`` is a singleton list it is never false, so the wrong path is never taken; then applying ``[0]`` to the whole thing gets the *b* or *c* that you really wanted. Ugly, but it gets you there in the rare cases where it is really inconvenient to rewrite your code using 'if'.
fr: Tim Peters (qui aurait souhaité que ce soit Steve Majewski) a suggéré la solution suivante: ``(a and [b] or [c])[0]``. Comme ``[b]`` est une liste d'un seul élément, il n'est jamais évalué à faux, le mauvais chemin n'est donc jamais prit, et appliquer ``[0]`` à l'ensemble vous donne le *b* ou *c* qque vous vouliez vraiment. Peu élégant, mais cela vous donne une solution pour les rares cas où il est vraiment peu pratique de réécrire le code sur une base de ``if``.

source: The best course is usually to write a simple ``if...else`` statement. Another solution is to implement the ``?:`` operator as a function::
fr: La meilleure solution est souvent d'écrire un simple ``if…else``. Une autre solution est d'implémenter l'opérateur ``?:`` comme une fonction::

source: In most cases you'll pass b and c directly: ``q(a, b, c)``. To avoid evaluating b or c when they shouldn't be, encapsulate them within a lambda function, e.g.: ``q(a, lambda: b, lambda: c)``.
fr: Dans la plupart des cas vous pourrez passer b et c directement: ``q(a,b,c)``. Pour éviter d'évaluer b et c quand il ne faut pas, encapsulez les dans une fonction lambda, exemple:``q(a, lambda: b, lambda: c)``.

source: It has been asked *why* Python has no if-then-else expression. There are several answers: many languages do just fine without one; it can easily lead to less readable code; no sufficiently "Pythonic" syntax has been discovered; a search of the standard library found remarkably few places where using an if-then-else expression would make the code more understandable.
fr: Il a souvent été demandé *pourquoi* Python n'avait pas d'expression if-the-else. Il y a plusieurs réponses à cette question: beaucoup de langages s'en sertent très bien sans en avoir une; elle peut aisément conduire à du code moins lisible; aucune syntaxe suffisamment "Pythonique" n'a été trouvée; une recherche dans la librairie standard à trouvé remarquablement peu d'endroit ou utiliser une expression if-then-else aurait rendu le code plus compréhensible.

source: In 2002, :pep:`308` was written proposing several possible syntaxes and the community was asked to vote on the issue. The vote was inconclusive. Most people liked one of the syntaxes, but also hated other syntaxes; many votes implied that people preferred no ternary operator rather than having a syntax they hated.
fr: En 2002, la :pep:`308` à été écrite, proposant plusieurs syntaxes et la communauté fut invité à voter. Le vote ne permit pas de tirer de conséquences. La plupart des gens aimaient une des syntaxes, mais détestaient les autres syntaxes; de nombreux votent exprimaient que les gens préféraient ne pas avoir d'opérateur ternaire que d'avoir une syntaxe qu'il détestent.

source: Is it possible to write obfuscated one-liners in Python?
fr: Est-il possible d'écrire des programmes volontairement difficile à comprendre sur une seule ligne en Python?

source: Yes. Usually this is done by nesting :keyword:`lambda` within :keyword:`lambda`. See the following three examples, due to Ulf Bartelt::
fr: Oui. Cela est généralement réalisé en imbriquant les :keyword:`lambda` les uns dans les autres. Observez les trois exemples suivants, contribués par Ulf Bartelt::

source: Don't try this at home, kids!
fr: Les enfants, ne faîtes pas ça chez vous!

source: Numbers and strings
fr: Nombres et chaines de caractères

source: How do I specify hexadecimal and octal integers?
fr: Comment puis-je spécifier des entiers hexadécimaux ou octaux?

source: To specify an octal digit, precede the octal value with a zero, and then a lower or uppercase "o". For example, to set the variable "a" to the octal value "10" (8 in decimal), type::
fr: Pour spécifier un entier octal, faites précéder la valeur octale par un zéro, puis un "o" majuscule ou minuscule. Par exemple assigner la valeur octale "10" (8 en décimal) à "a", tapez::

source: Hexadecimal is just as easy. Simply precede the hexadecimal number with a zero, and then a lower or uppercase "x". Hexadecimal digits can be specified in lower or uppercase. For example, in the Python interpreter::
fr: L'hexadécimal est tout aussi simple, faîtes précéder le nombre hexadécimal par un zéro, puis un "x" majuscule ou minuscule. Les nombres hexadécimaux peuvent être écrit en majuscules ou en minuscules. Par exemple, dans l'interpréteur Python::

source: Why does -22 // 10 return -3?
fr: Pourquoi -22//10 retourne-t'il -3?

source: It's primarily driven by the desire that ``i % j`` have the same sign as ``j``. If you want that, and also want::
fr: Cela est principalement due à la volonté que ``i % j`` ait le même signe que j. Si vous voulez cela, vous voulez aussi::

source: then integer division has to return the floor. C also requires that identity to hold, and then compilers that truncate ``i // j`` need to make ``i % j`` have the same sign as ``i``.
fr: Alors la division entière doit retourner l'entier inférieur. Le C demande aussi à ce que cette égalité soit vérifiée, et donc les compilateur qui tronquent ``i//j`` ont besoin que ``i % j`` ait le même signe que ``i``.

source: There are few real use cases for ``i % j`` when ``j`` is negative. When ``j`` is positive, there are many, and in virtually all of them it's more useful for ``i % j`` to be ``>= 0``. If the clock says 10 now, what did it say 200 hours ago? ``-190 % 12 == 2`` is useful; ``-190 % 12 == -10`` is a bug waiting to bite.
fr: Il y a peu de cas d'utilisation réels pour ``i%j`` quand ``j`` est négatif. Quand ``j`` est positif, il y en a beaucoup, et dans pratiquement tous, il est plus utile que ``i % j`` soit ``>=0``. Si l'horloge dit 10h maintenant, que disait-elle il y a 200 heures? ``-190%12 == 2`` est utile; ``-192 % 12 == -10`` est un bug qui attends pour mordre.

source: How do I convert a string to a number?
fr: Comment puis-je convertir une chaine de caractère en nombre?

source: For integers, use the built-in :func:`int` type constructor, e.g. ``int('144') == 144``. Similarly, :func:`float` converts to floating-point, e.g. ``float('144') == 144.0``.
fr: Pour les entiers, utilisez la fonction built-in :func: `int` de type constructeur, par exemple ``int('144') == 144``. De façon similaire, :func:`float` convertit en valeur flottante, par exemple ``float('144')`` == 144.0``.

source: By default, these interpret the number as decimal, so that ``int('0144') == 144`` and ``int('0x144')`` raises :exc:`ValueError`. ``int(string, base)`` takes the base to convert from as a second optional argument, so ``int('0x144', 16) == 324``. If the base is specified as 0, the number is interpreted using Python's rules: a leading '0' indicates octal, and '0x' indicates a hex number.
fr: Par défaut, ces fonctions interprètent les nombre en tant que décimaux, de telles façons que ``int('0144')==144`` et ``int('0x144')`` remontent :exc:`ValueError`. ``int(string, base)`` prends la base depuis laquelle il faut convertir dans le second argument, optionnel, donc ``int('0x144', 16) == 324``. Si la base donnée est 0, le nombre est interprété selon les règles Python: un '0' en tête indique octal, et '0x' indique un hexadécimal.

source: Do not use the built-in function :func:`eval` if all you need is to convert strings to numbers. :func:`eval` will be significantly slower and it presents a security risk: someone could pass you a Python expression that might have unwanted side effects. For example, someone could pass ``__import__('os').system("rm -rf $HOME")`` which would erase your home directory.
fr: N'utilisez pas la fonction built-in :func:`eval` si tout ce que vous avez besoin est de convertir des chaines en nombres. :func:`eval` sera significativement plus lent et implique des risque de sécurité: quelqu'un pourrait vous envoyez une expression Python pouvant avoir des effets de bord indésirables. Par exemple, quelqu'un pourrait passer ``__import__('os').system("rm -rf $HOME")`` ce qui aurait pour effet d'effacer votre répertoire personnel.

source: :func:`eval` also has the effect of interpreting numbers as Python expressions, so that e.g. ``eval('09')`` gives a syntax error because Python does not allow leading '0' in a decimal number (except '0').
fr: :func:`eval` a aussi pour effet d'interpréter les nombres comme comme des expression python, ainsi ``eval('09')`` produit une erreur de syntaxe par ce que Python ne permet pas les '0' en tête d'un nombre décimal (à l'exception du nombre '0').

source: How do I convert a number to a string?
fr: Comment convertir un nombre en chaine de caractère?

source: How do I modify a string in place?
fr: Comment modifier une chaine de caractère "en place"?

source: You can't, because strings are immutable. If you need an object with this ability, try converting the string to a list or use the array module::
fr: Vous ne pouvez pas, par ce que les chaines de caractères sont immuables, Si vous avez besoin d'un objet ayant une telle capacité, essayez de convertir la chaine en liste, ou utilisez le module array::

source: How do I use strings to call functions/methods?
fr: Comment utiliser des chaines de caractères pour appeler des fonctions/méthodes?

source: There are various techniques.
fr: Il y a différentes techniques.

source: The best is to use a dictionary that maps strings to functions. The primary advantage of this technique is that the strings do not need to match the names of the functions. This is also the primary technique used to emulate a case construct::
fr: La meilleure est d'utiliser un dictionnaire qui fait correspondre les chaines de caractères à des fonctions. Le principal avantage de cette technique est que les chaines n'ont pas besoin d'être égales aux noms de fonctions. C'est aussi la principale façon d'imiter la construction "case"::

source: Use the built-in function :func:`getattr`::
fr: Utiliser la fonction :func:`getattr`::

source: Note that :func:`getattr` works on any object, including classes, class instances, modules, and so on.
fr: Notez que :func:`getattr` marche sur n'importe quel objet, ceci inclue les classes, les instances de classes, les modules et ainsi de suite.

source: This is used in several places in the standard library, like this::
fr: Ceci est utilisé dans plusieurs endroit de la bibliothèque standard, de cette façon::

source: Use :func:`locals` or :func:`eval` to resolve the function name::
fr: Utilisez :func:`locals` ou :func:`eval` pour résoudre le nom de fonction::

source: Note: Using :func:`eval` is slow and dangerous. If you don't have absolute control over the contents of the string, someone could pass a string that resulted in an arbitrary function being executed.
fr: Note: En utilisant :func:`eval` est lent est dangereux. Si vous n'avez pas un contrôle absolu sur le contenu de la chaine de caractère, quelqu'un peut passer une chaine de caractère pouvant résulter en l'exécution de code arbitraire.

source: Is there an equivalent to Perl's chomp() for removing trailing newlines from strings?
fr: Existe-t'il un équivalent à la fonction chomp() de Perl, pour retirer les caractères de fin de ligne d'une chaine de caractère?

source: Starting with Python 2.2, you can use ``S.rstrip("\r\n")`` to remove all occurences of any line terminator from the end of the string ``S`` without removing other trailing whitespace. If the string ``S`` represents more than one line, with several empty lines at the end, the line terminators for all the blank lines will be removed::
fr: À partir de Python 2.2 vous pouvez utiliser ``S.rstrip(" ")`` pour retirer toute occurrence de n'importe quel terminateur de ligne à la fin d'une chaine de caractère ``S``, sans retirer aucun espace de fin de ligne. Si la chaine ``S`` représente plus d'une ligne, avec plusieurs lignes vides, les terminateurs de lignes de toutes les lignes vides seront retirés::

# >>> lines = ("line 1 " ... " " ... " ") >>> lines.rstrip(" ") 'line 1 '
source: >>> lines = ("line 1 \r\n" ... "\r\n" ... "\r\n") >>> lines.rstrip("\n\r") 'line 1 '
fr: >>> lines = ("line 1 " ... " " ... " ") >>> lines.rstrip(" ") 'line 1 '

source: Since this is typically only desired when reading text one line at a time, using ``S.rstrip()`` this way works well.
fr: Du fait que ce soit principalement utile en lisant un texte ligne à ligne, utiliser ``S.rstrip()`` devrait marcher correctement.

source: For older versions of Python, there are two partial substitutes:
fr: Pour les versions plus anciennes de python, il y a deux substituts partiels disponibles.

source: If you want to remove all trailing whitespace, use the ``rstrip()`` method of string objects. This removes all trailing whitespace, not just a single newline.
fr: Si vous voulez retirer tous les espaces de fin de ligne, utilisez la méthode ``rstrip()`` des chaines de caractères. Cela retire tous les espaces de fin de ligne, pas seulement le caractère de fin de ligne.

source: Otherwise, if there is only one line in the string ``S``, use ``S.splitlines()[0]``.
fr: Sinon, s'il y a seulement une ligne dans la chaine ``S``, utilisez ``S.splitlines()``[0].

source: Is there a scanf() or sscanf() equivalent?
fr: Existe-t'il un équivalent à scanf() ou sscanf()?

source: Not as such.
fr: Pas exactement.

source: For simple input parsing, the easiest approach is usually to split the line into whitespace-delimited words using the :meth:`~str.split` method of string objects and then convert decimal strings to numeric values using :func:`int` or :func:`float`. ``split()`` supports an optional "sep" parameter which is useful if the line uses something other than whitespace as a separator.
fr: Pour une simple analyse de chaine, l'approche la plus simple est généralement de découper la ligne en mots délimités par des espaces, en utilisant la méthode :meth:`~str.split` des objets chaine de caractères, et ensuite de convertir les chaines de décimales en valeurs numériques en utilisant la fonction :func:`int` ou :func:`float`, ``split()`` supporte un paramètre optionnel "sep" qui est utile si la ligne utilise autre chose que des espaces comme séparateur.
